#include "checksum.h"

/** @file
  \brief Подсчет контрольной суммы файла
  
  Объект выполняет функцию подсчета контрольной суммы файла по алгоритму
  checksum = word1 + word2 + ... + wordN,
  где word - 32битное значение из файла
*/

//////////////////////////////////////////////////////////////////////////////
/// Конструктор
/// \param char *name имя файла
/// \param int mode режим открытия файла
/// \param int access режим доступа к файлу
CheckSum::CheckSum(char *name, int mode, int access)
         : TextFile(name, mode, access)
{
check_sum = 0;
}
///////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////
/// Деструктор
CheckSum::~CheckSum()
{
check_sum = 0;
}
///////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////
/// Сканирование файла и подсчет суммы
/// \param нет
/// \return контрольная сумма в случае успеха, 0xFFFFFFFF в случае ошибки (код ошибки в getError())
uint32_t CheckSum::get_checksum()
{
check_sum = 0;
// Сканируем файл
if(TextFile::scan(32768, 0, false) != -1)
{
    return check_sum;
}
return BAD_CHECKSUM;
}
///////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////
/// Разбор блока файла
/// \param [in] char *str указатель на блок файла
/// \param [in] int32_t pos позиция строки в файле (игнорируется)
/// \param [in] int len количество символов в блоке
/// \return 0 в случае успеха, -1 в случае ошибки, требующей прекращения разбора файла
int CheckSum::parse(char *str, int32_t pos, int len)
{
if(str && len > 0)
{
    uint32_t word;
	off_t bytes;
	do
	{
		word = 0;
		bytes = sizeof(uint32_t);
		if(len < bytes)
			bytes = len % sizeof(uint32_t);
		memmove(&word, str, bytes);
		check_sum += word;
		len -= bytes;
		str += bytes;
	}
	while(len > 0);
}
else
	return -1;
return 0;
}
///////////////////////////////////////////////////////////////////////////////

